# Adding taps (repos) on top
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "homebrew/cask-fonts"

# Files that I might install
brew "switchaudio-osx"
cask "brave-browser"
cask "canva"
cask "discord"
cask "gimp"
cask "imageoptim"
cask "postman"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "libreoffice"
cask "microsoft-teams"
cask "mysqlworkbench"
vscode "Compilenix.vscode-zonefile"
vscode "devMike.mikrotik-routeros-script"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "tamasfe.even-better-toml"
